perf/results/section-two/async/cfg-async.yaml
config:
  environments:
    async:
      target: 'http://localhost:5555/node/async'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Steady
      duration: 30   # seconds
      arrivalRate: 1
    - name: SlowIncrease
      duration: 240   # seconds
      arrivalRate: 1
      rampTo: 1000
    - name: Reset Line  # useful for resetting Grafana stats
      duration: 60
      arrivalRate: 1

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'